Repository: pedrobae/cipherApp
Catalog: cipher_app/lib/l10n/app_*.arb
Languages: pt

source: Login or Sign Up
pt: Login ou Cadastro

# loginDescription
source: Please select your preferred method to continue setting up your account
pt: Selecione um método para terminar de configurar sua conta

# emailLogin
source: Continue with Email
pt: Entrar com E-mail

# phoneLogin
source: Continue with Phone
pt: Entrar com Telefone

# accountCreationPrefix
source: If you are creating a new account,
pt: Se você está criando uma conta,

# accountCreationMiddle
source: and
pt: e

# accountCreationSuffix
source: will apply.
pt: se aplicarão.

# termsAndConditions
source: Terms & Conditions
pt: Termos & Condições

source: Privacy Policy
pt: Política de Privacidade

source: Library
pt: Biblioteca
