Repository: pedrobae/cipherApp
Catalog: CORDIS/lib/l10n/app_*.arb
Languages: pt

source: Setup
pt: Configuração

# comingSoon
source: Feature under development
pt: Funcionalidade em desenvolvimento

source: Authentication
pt: Autenticação

source: Password
pt: Senha

source: Log In
pt: Entrar

# logInTitlePrefix
source: Sign in to
pt: Login no

# logOut
source: Sign Out
pt: Sair

# accountCreationPrefix
source: New User?
pt: Não tem uma conta?

# accountCreationSuffix
source: Sign Up
pt: Registre-se.

source: Forgot Password?
pt: Esqueceu a Senha?

# forgotPasswordSuffix
source: Please try again or Request a new one.
pt: Por favor, tente novamente ou solicite uma nova.

source: User
pt: Usuário

source: Guest
pt: Convidado

source: Name
pt: Nome

# enterNameHint
source: Enter name...
pt: Insira o nome...

# enterEmailHint
source: Enter email...
pt: Insira o e-mail...

source: Please enter name and email.
pt: Por favor, insira o nome e o e-mail.

source: User not found in cloud.
pt: Usuário não encontrado na nuvem.

source: Library
pt: Biblioteca

source: Schedule
pt: Agenda

# settings
source: Configuration
pt: Configurações

source: About
pt: Sobre

# cipher
source: Song
pt: Cifra

source: Title
pt: Título

# titleHint
source: Enter a title
pt: Insira o título...

source: Author
pt: Autor

# musicKey
source: Key
pt: Tom

# duration
source: Estimated Time (MM:SS)
pt: Duração

source: Language
pt: Idioma

source: Version
pt: Versão

source: Version Name
pt: Nome da Versão

source: versions
pt: versões

source: Estimated Time
pt: Tempo Estimado

source: Notes
pt: Anotações

source: Sections
pt: Seções

source: Section
pt: Seção

source: Song Structure
pt: Mapa da Música

# selectSectionType
source: Select your Section
pt: Selecione sua Seção

source: Lyrics
pt: Letras

source: Section Code
pt: Código da Seção

source: Section Type
pt: Tipo da Seção

source: Section Color
pt: Cor da Seção

source: Section Text...
pt: Texto da Seção...

# cipherEditorTitle
source: Song Editor
pt: Editor de Cifras

# cloudCipher
source: Cloud Song Map
pt: Cifra na Nuvem

# cipherParsing
source: Choosing Parsing
pt: Escolhendo Análise

source: Info
pt: Informações

source: Cipher created successfully!
pt: Cifra criada com sucesso!

source: Cipher saved successfully!
pt: Cifra salva com sucesso!

source: Failed to create cipher.
pt: Falha ao criar cifra.

source: Failed to create version.
pt: Falha ao criar versão.

# cannotCreateCipherExistingCipher
source: Could not create cipher: existing cipher found.
pt: Não foi possível criar a cifra porque uma cifra com o mesmo ID já existe.

# deleteCipherDescription
source: When deleting a song, all its versions will also be deleted. This action cannot be undone.
pt: Ao excluir uma cifra, todas as suas versões também serão excluídas. Esta ação não pode ser desfeita.

# searchCiphers
source: Search title, author...
pt: Pesquisar por título, autor...

source: Filter
pt: Filtrar

source: Sort
pt: Ordenar

# emptyCipherLibrary
source: No Songs in the Library. Please add songs to get started.
pt: Nenhuma Música na Biblioteca. Por favor, adicione músicas para começar.

source: Flow Item
pt: Texto

# namePlaylistPrompt
source: Name your playlist
pt: Nomeie sua playlist

# createPlaylistInstructions
source: Create an empty playlist first, you can add songs and flow items later.
pt: Crie uma playlist vazia primeiro, você pode adicionar músicas e seções faladas depois.

# playlistNameLabel
source: Playlist Name
pt: Nome da Playlist

# playlistNameHint
source: Enter a playlist name
pt: Insira o nome da playlist

# searchPlaylist
source: Search playlists...
pt: Pesquisar por nome da playlist...

# emptyPlaylistLibrary
source: No Playlists found. Please create a playlist to get started.
pt: Nenhuma Playlist criada. Por favor, crie uma playlist para começar.

source: Add to Playlist
pt: Adicionar à Playlist

# emptyPlaylist
source: This Playlist is empty.
pt: Esta Playlist está vazia.

# emptyPlaylistInstructions
source: Please add Song and Flow items to build your playlist.
pt: Por favor, adicione músicas e itens de Texto para construir sua playlist.

# noPlaylistItems
source: No items in this playlist.
pt: Nenhum item nesta playlist.

# deletePlaylistDescription
source: When deleting a playlist, all of its items will also be deleted. This action cannot be undone.
pt: Ao excluir uma playlist, todos os seus itens também serão excluídos. Esta ação não pode ser desfeita.

source: Theme
pt: Tema

# themeSubtitle
source: Customize the appearance of the app
pt: Customize a aparência do aplicativo

source: Change Language
pt: Mudar Idioma

# changeLanguageSubtitle
source: Change the application language
pt: Alterar o idioma do aplicativo

source: Development Tools
pt: Ferramentas de Desenvolvimento

source: Database
pt: Banco de Dados

source: Reset Database
pt: Redefinir Banco de Dados

# resetDatabaseSubtitle
source: Wipes the entire database
pt: Apaga todo o banco de dados

source: Database Information
pt: Informações do Banco de Dados

source: Records per Table
pt: Registros por tabela:

# tableData
source: Table: {tableName}
pt: Dados da tabela: {tableName}

# databaseInfoSubtitle
source: View tables and entries in the database
pt: Visualizar tabelas e entradas no banco de dados

source: Reload Interface
pt: Recarregar Interface

# reloadInterfaceSubtitle
source: Clears cached data and reloads all providers
pt: Limpa os dados em cache e recarrega todos os provedores

source: Role
pt: Função

source: General Member
pt: Membro Geral

source: Share
pt: Compartilhar

# viewPlaceholder
source: View {object}
pt: Visualizar {object}

# createPlaceholder
source: Create {object}
pt: Criar {object}

# editPlaceholder
source: Edit {object}
pt: Editar {object}

# addPlaceholder
source: Add {object}
pt: Adicionar {object}

# savePlaceholder
source: Save {object}
pt: Salvar {object}

# duplicatePlaceholder
source: Duplicate {object}
pt: Duplicar {object}

# duplicateTooltip
source: Create a copy of this {object}
pt: Criar uma cópia desta {object}

source: Schedule Name
pt: Nome da Agenda

source: Date
pt: Data

source: Start Time
pt: Hora de Início

source: Location
pt: Localização

source: Room/Venue
pt: Sala/Local

source: Annotations
pt: Anotações

source: Schedule Playlist
pt: Agendar Playlist

source: Change Playlist
pt: Alterar Playlist

# selectPlaylistForScheduleInstruction
source: Please create a schedule by selecting a playlist below.
pt: Por favor, crie uma agenda selecionando uma playlist abaixo.

source: Schedule Details
pt: Detalhes da Agenda

# fillScheduleDetailsInstruction
source: Please fill in the schedule details.
pt: Por favor, preencha os detalhes da agenda.

# createRolesAndAssignUsersInstruction
source: Please create roles and assign Members to the schedule.
pt: Por favor, crie funções e atribua Membros à agenda.

# pleaseEnterScheduleName
source: Please enter a schedule name.
pt: Por favor, insira um nome para a agenda.

# pleaseEnterDate
source: Please enter a valid date (DD/MM/YYYY).
pt: Por favor, insira uma data válida (DD/MM/AAAA).

# pleaseEnterStartTime
source: Please enter a valid start time (HH:MM).
pt: Por favor, insira uma hora de início válida (HH:MM).

# pleaseEnterLocation
source: Please enter a location.
pt: Por favor, insira um local.

# noRoles
source: No roles yet.
pt: Nenhum Papel Definido

# addRolesInstructions
source: Add your own roles and people, and assign them to this schedule.
pt: Adicione seus próprios papéis e pessoas, e atribua-as a esta agenda.

# roleNameHint
source: e.g., Worship Leader, Vocalist
pt: ex.: Dirigente, Vocalista...

source: Member
pt: Membro

source: Assign Members to {role}
pt: Atribuir Membro à {role}

# noMembers
source: No members yet.
pt: Nenhum Membro Atribuído

# xMembers
source: {count} members
pt: {count} Membros

source: Next Up
pt: Próxima Agenda

# futureSchedules
source: Next Schedules
pt: Próximos Eventos

source: Past Schedules
pt: Eventos Passados

source: Search schedule...
pt: Pesquisar nome, local...

source: Assign Schedule
pt: Agendar

# scheduleActions
source: Service Actions
pt: Ações da Agenda

source: No playlist assigned.
pt: Nenhuma playlist atribuída.

# emptyScheduleLibrary
source: Schedule is empty. Please create a service to get started.
pt: Agenda vazia. Por favor, crie um evento para começar.

source: Schedule Not Found
pt: Agenda Não Encontrada

# scheduleNotFoundMessage
source: The requested schedule could not be found.
pt: A agenda solicitada não pôde ser encontrada.

# deleteScheduleTooltip
source: Permanently delete this service
pt: Excluir permanentemente esta agenda

source: Play
pt: Tocar

# nextPlaceholder
source: Next: {title}
pt: Próximo: {title}

source: Create
pt: Criar

source: Create Manually
pt: Criar Manualmente

source: Import
pt: Importar

source: Import from PDF
pt: Importar de PDF

source: Select PDF File
pt: Selecionar Arquivo PDF

source: Selected File:
pt: Arquivo Selecionado:

source: Process PDF
pt: Processar PDF

source: How to Import
pt: Como Importar

# importInstructions
source: • Select a PDF with the song map • Separate verses with empty lines or Labels • Chords above the lyrics at the correct positions
pt: • Selecione um PDF com cifra • Fonte mono é recomendada se possível • Separe estrofes com linhas vazias • Acordes acima das letras

source: Import from Image
pt: Importar de Imagem

source: Import from Text
pt: Importar de Texto

# pasteTextPrompt
source: Paste the cipher text here...
pt: Cole o texto da cifra aqui...

# importedFrom
source: Song imported from {importType}
pt: Cifra importada de {importType}

# playlistVersionName
source: {playlistName}'s Version
pt: Versão do {playlistName}

source: Parsing Strategy
pt: Estratégia de Processamento

source: Double New Line
pt: Dupla Nova Linha

source: Section Labels
pt: Rótulos de Seção

source: PDF Formatting
pt: Formatação PDF

source: Import Variation
pt: Variação de Importação

source: PDF with Columns
pt: PDF com Colunas

# pdfNoColumns
source: PDF without Columns
pt: PDF sem Colunas

# textDirect
source: Direct Text
pt: Texto Simples

# imageOcr
source: Image with OCR
pt: Imagem com OCR

source: Choose Language
pt: Escolher Idioma

# selectAppLanguage
source: Select the application language:
pt: Selecione o idioma do aplicativo:

source: Portuguese
pt: Português

source: English
pt: Inglês

source: Load
pt: Carregamento

source: Loading...
pt: Carregando...

source: Try Again
pt: Tentar Novamente

source: Save
pt: Salvar

source: Cancel
pt: Cancelar

source: Confirm
pt: Confirmar

# keepGoing
source: Continue
pt: Continuar

source: Quick Action
pt: Ação Rápida

# copySuffix
source: (Copy)
pt: (Cópia)

source: Assign
pt: Atribuir

source: Clear
pt: Limpar

source: Delete
pt: Excluir

# deleteConfirmationTitle
source: Confirm Deletion
pt: Confirmar Exclusão

# deleteConfirmationMessage
source: Are you sure you want to delete this {object}?
pt: Tem certeza de que deseja excluir este {object}?

# deleteWarningMessage
source: This action cannot be undone.
pt: ATENÇÃO: Esta ação não pode ser desfeita.

# helloUser
source: Hello {userName}
pt: Olá {userName}

source: Welcome
pt: Bem-vindo

# getStartedMessage
source: Get started by creating or importing your first song map.
pt: Comece criando ou importando sua primeira cifra.

source: by
pt: por

# titleWithPlaceholder
source: Title: {title}
pt: Título: {title}

# authorWithPlaceholder
source: Author: {author}
pt: Autor: {author}

# keyWithPlaceholder
source: Key: {key}
pt: Tom: {key}

# nSections
source: {count} sections
pt: {count} seções

# keyHint
source: Select key...
pt: Selecione o Tom...

# stepXofY
source: Step {current} of {total}
pt: Passo {current} de {total}

source: Error
pt: Erro

# errorMessage
source: Error during {job}: {errorDetails}
pt: Erro durante {job}: {errorDetails}

# invalidTimeFormat
source: Invalid time format. Please use MM:SS.
pt: Formato de tempo inválido. Por favor, use MM:SS.

# fieldRequired
source: This field is required.
pt: Este campo é obrigatório.

# optionalPlaceholder
source: {field} (Optional)
pt: {field} (Opcional)
